/*
                   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
            佛祖保佑       永无BUG
*/

/********************************************************************************
* @File name   : main.c
* @Author      : Daemon.Chen
* @Version     : Released
* @Date        : 2024-5-4
* @Description : 程序运行主函数
********************************************************************************/
#include "delay.h"             /*延时函数头文件*/
#include "sys.h"               /*系统头文件*/
#include "FreeRTOS.h"          /*FreeRTOS头文件*/
#include "task.h"              /*任务头文件*/
#include "TaskManage.h"        /*任务管理头文件（主要功能实现）*/
#include "SysTick.h"           /*滴答定时器头文件*/

/*******************************************************************************
* Function Name  : SystemHardwareDriverInit
* Description    : 1.系统硬件驱动初始化。
									 2.滴答定时器初始化。
									 3.创建任务。
									 4.开启任务调度。
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main(void)
{
	SystemHardwareDriverInit();	 /*系统硬件驱动初始化*/
	SysTick_Init(72);            /*滴答定时器初始化*/
	TaskCreateFunction();  			 /*创建任务*/
	vTaskStartScheduler();       /*开启任务调度*/
}

